import 'package:flutter/material.dart';

class NewsPage extends StatelessWidget {
  const NewsPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.end,
          children: [
            const Padding(
              padding: EdgeInsets.all(8.0),
              child: Text(
                "نظر مدیرفنی سابق پی‌اس‌جی راجع به شرایط امباپه",
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 20),
              ),
            ),
            const SizedBox(height: 10),
            SizedBox(
              width: double.infinity,
              child: Image.network(
                  "https://storage.footballi.app/800/news/images/2023/07/09/16889387326407.jpeg"),
            ),
            const SizedBox(height: 10),
            const Padding(
              padding: EdgeInsets.all(8.0),
              child: Text('''
            پایگاه خبری فوتبالی - لئوناردو مدیرفنی سابق پاریسن ژرمن به کیلیان امباپه گفت که هرچه سریع‌تر از این باشگاه جدا شود.
            
            به گزارش فوتبالی، آینده کیلیان امباپه در پاریسن ژرمن کاملاً مبهم است. او ماه پیش با ارسال نامه‌ای به ناصر الخلیفی اعلام کرد که قصد تمدید قراردادش را ندارد و فصل آینده، آخرین فصل حضورش در پارک دو پرنس خواهد بود. البته این مسئله اصلاً به مذاق ناصر الخلیفی خوش نیامد و او به کیلیان امباپه دستور داده که قراردادش را تمدید کند، چون در غیر این صورت باید به فروش برسد. رئال مادرید مدت‌هاست به دنبال جذب کیلیان امباپه است، اما هنوز موفق به انجام این کار نشده و گفته می شود که پرز می خواهد قهرمان جام جهانی 2018 را در تابستان آینده به صورت رایگان به خدمت بگیرد. 
            
            به نقل از سایت گل، لئوناردو به اکیپ گفت: "برای صلاح پاریسن ژرمن، فکر کنم زمان رفتن امباپه فرا رسیده است. پاریسن ژرمن قبل از امباپه نیز وجود داشت و بعد از خروج این بازیکن نیز باشگاه بزرگی خواهد ماند. امباپه به مدت 6 فصل است که در پاریسن ژرمن بازی می کند و در آن 6 فصل، 5 باشگاه مختلف قهرمان اروپا شده اند. رئال مادرید در سال 2018 و 2022، لیورپول در سال 2019، بایرن مونیخ در سال 2020، چلسی در سال 2021 و منچسترسیتی در سال 2023 و امباپه اصلاً عضو این تیم‌ها نبوده است. حتی بدون امباپه هم می توانید قهرمان اروپا شوید."
            
            4416
            '''),
            )
          ],
        ),
      ),
    );
  }
}
