class HotNews {
  String title, images, subtitle;

  HotNews({required this.title, required this.images, required this.subtitle});
}

List hotNews = [
  HotNews(
      images:
          "https://storage.footballi.app/800/news/images/2023/07/09/16889046208366.jpeg",
      title: "پایگاه خبری فوتبالی - لوکاس هرناندز رسما به پی اس جی پیوست.",
      subtitle:
          '''به گزارش فوتبالی، ملی پوش فرانسوی که سابقه حضور در اتلتیکو مادرید را در کارنامه اش دارد، با انتقالی به مبلغ 40 میلیون یورو (نصف مبلغی که بایرن چهار سال پیش یعنی درسال 2019 به اتلتیکو پرداخته بود) از بایرن مونیخ به پی اس جی پیوست. لوکاس قراردادی بلندمدت را امضا کرد و بخش مهمی از پروژه جدید پی اس جی خواهد بود و خط دفاعی را در کنار اشکرینیار تکمیل خواهد کرد.
لوکاس هرناندز جمعه گذشته تست پزشکی پی اس جی را پشت سر گذاشت و با قراردادی چهار ساله راهی پی اس جی شد. او توان حضور در پست دفاع میانی و دفاع چپ را دارد. او چهار سال در بایرن مونیخ حضور داشت و 107 بازی در این تیم انجام داد که در فاصله یک سال تا اتمام قراردادش با بایرن مونیخ از این تیم جدا شد. 
لوکاس در فصل 23-2022 با مصدومیت شدیدی  در اولین بازی جام جهانی قطر مواجه شد.  این بازیکن حالا می تواند نقش مهمی در ترکیب پی اس جی در فصل آینده داشته باشد. پاریسی ها روزهای پرکاری را در بازار نقل و انتقالات داشته اند و در روزهای اخیر سایر خریدهایشان نظیر کانگ این لی، آسنسیو و اوگارته را اعلام کرده بودند.
4125'''),
////////////////////////////////////////////////////
  HotNews(
      title: "مدافع انگلیسی دیگر کاپیتان منچستر یونایتد نخواهد بود",
      images:
          "https://storage.footballi.app/800/news/images/2023/07/09/16889087523891.jpeg",
      subtitle:
          '''پایگاه خبری فوتبالی – هری مگوایر به زودی از سمت کاپیتانی منچستر یونایتد خلع خواهد شد و اریک تن هاگ جانشین او را می‌کند.
به گزارش فوتبالی، با توجه به اینکه هری مگوایر جایی در برنامه‌های اریک تن هاگ ندارد به نظر می‌رسد دوران حضور گران ترین مدافع تاریخ در منچستر یونایتد به پایان رسیده است. این مدافع انگلیسی تنها 8 بازی را در فصل گذشته لیگ جزیره از ابتدا به میدان رفت در حالی که مارتینز، واران، لیندلوف و حتی لوک شاو که مدافع چپ تخصصی است جلوتر از از او در لیست انتخاب های تن هاگ برای ترکیب اصلی قرار دارند. هرچند او همچنان یکی از بازیکنان کلیدی تیم ملی انگلیس باقی مانده است، گرت ساوتگیت به او اطلاع داده که باید زمان بازی مشخصی را به دست بیاورد اما با این وجود اخبار زیادی درباره احتمال جا به جایی او در ماه های اخیر به گوش نرسیده است. مگوایر از زمان جدایی اشلی یانگ در فصل 2020 بازوبند کاپیتانی شیاطین سرخ را در اختیار داشته است و علی رغم اینکه اخیرا زمان بازی زیادی به او نرسیده است، تن هاگ اصرار داشته است که تا وقتی در اولدترافورد حضور دارد بازوبند کاپیتانی یونایتد را از او نخواهد گرفت. هرچند تاک اسپورت گزارش داده است که سرمربی هلندی زیر قول خود خواهد زد و حتی در صورتی که فصل اینده در منچستر یونایتد بماند بازوبند کاپیتانی را از این مدافع انگلیسی خواهد گرفت. همچنین گفته می‌شود که تن هاگ کاپیتان بعدی خود را انتخاب کرده است و طی تصمیمی که تعجب آور هم نخواهد بود، این مسئولیت به برونو فرناندز محول خواهد شد.
2102'''),

  HotNews(
      title:
          "نقل و انتقالات/ چلسی به دنبال مهاجم آرسنال؛ شرط انتقال روکه به بارسا در همین تابستان",
      images:
          "https://storage.footballi.app/800/news/images/2023/07/09/16889076378040.jpeg",
      subtitle: '''
پایگاه خبری فوتبالی – چلسی جدید ترین مشتری فولارین بالوگان مهاجم جوان تیم ارسنال است.
به گزارش فوتبالی، بایرن مونیخ آماده می‌شود تا پیشنهاد دیگری برای هری کین به تاتنهام ارسال کند اما حتی افزایش این پیشنهاد به 70 میلیون پوند هم تاتنهام را برای فروش ستاره انگلیسی خود متقاعد نخواهد کرد. (Daily Mail)
رئال مادرید ناگهان از کیلیان امباپه فاصله گرفته است و هرگونه تماسی با خود بازیکن یا پاری سن ژرمن را انکار کرده است. (Marca).
گزارش‌ها می‌گویند که امباپه سه پیشنهاد جدید را از طرف پاری سن ژرمن رد کرده است. (Ramon Alvarez).
اگر بارسلونا موفق شود تا حداقل دو نفر از بین فران تورس، انسو فاتی، فرانک کسیه و اریک گارسیا را بفروشد، ممکن است بتواند ویکتور روکه را در همین تابستان به خدمت بگیرد و مجبور نشود تا ژانویه صبر کند. (AS).
اریک تن هاگ تصمیم گرفته است تا جیدون سانچو، هری مگوایر، اسکات مک تامینی و فرد را بفروشد و روندی بی‌رحمانه را برای بازسازی منچستر یونایتد آغاز کند.(Mirror).
راسموس هویلند، هدف نقل و انتقالاتی منچستر یونایتد، در صورتی که این تیم بر سر مبلغ انتقال با آتالانتا به مشکل بر بخورد به باشاه خود فشار خواهد آورد تا این معامله را تسهیل ببخشد. (Football Transfers).
چلسی که در تلاش است تا یک مهاجم مرکزی جذب کند، مذاکراتی را با آرسنال برای جذب احتمالی فولارین بالوگان که فصل موفقی را به صورت قرضی در تیم رنس فزانسه سپری کرد، شروع کرده است. (Daily Mail)
2102
'''),

  HotNews(
      title: "یوونتوس جانشین ولاهوویچ را انتخاب کرد",
      images:
          "https://storage.footballi.app/800/news/images/2023/07/09/16889070094132.jpeg",
      subtitle: '''
پایگاه خبری فوتبالی - سویا در حالی از امروز تمریناتش را آغاز کرد که آینده برخی از ستارگان این تیم مشخص نیست که یکی از این نفرات هم یوسف النصیری مهاجم مراکشی است.
به گزارش فوتبالی، یوونتوس در حال حاضر به طور جدی شرایط خرید یوسف النصیری را دنبال می کند. در حقیقت بازیکن مراکشی در بخش دوم فصل گذشته خوش درخشید و باشگاه ایتالیایی در نظر دارد که در صورت جدایی دوشان ولاهوویچ، او را به ترکیبش اضافه کند. در واقع یووه به درآمدزایی از فروش ولاهوویچ در این تابستان فکر می کند و حتی به جایگزین های احتمالی این مهاجم صربستانی نیز فکر کرده است.
گاتزتا دلوا اسپورت گزارش داده است که یووه امیدوار است که النصیری را با مبلغی کمتر از 30 میلیون یورو به خدمت بگیرد. البته سویا برای فروش این مهاجم بیش از 40 میلیون یورو خواسته است. در حال حاضر سویا به فروش برخی بازیکنانش نیاز دارد تا از پول ان برای خرید چهره های جدید استفاده کند.
النصیری در بخش دوم فصل گذشته در سویا خوش درخشید. وستهام یکی دیگر از تیم هایی است که در ماه های اخیر شرایط خرید این مهاجم را دنبال کرده است. ولاهوویچ مشتریان زیادی از انگلیس دارد و اگر از یووه جدا شود، تورینی ها به فکر خرید یک جایگزین مطمئن برای او خواهند بود.
4125
''')
];
